[{"title": "Charlie Mack (1st Out Of The Limo)", "artist": "DJ Jazzy Jeff & The Fresh Prince", "lyric": "(So damn tough)\n(Fresh)\n(So damn tough)\nEverywhere we go downtown or to a show\nWe have two necessities Charlie Mack and our limo\nHe's feared by suckers yet he's loved by kids\nPay attention and let me tell you who Charlie Mack is\nHe is our homeboy from around the block\nHe's regarded through the city as the hip-hop cop\nHeight about 6'6\", weight about 290\nEverywhere I go Charlie Mack is right behind me\nHe never laughs, never smiles nor sweats\nHe doesn't breaks arms or legs, only spines or necks\nHe once killed a man 'cause he would not let go of his Ego\nApollo Creed is a sucker Charlie Mack could be Drago\nHe could bench about three hundred pounds\nThe cops all take a vacation, when Charlie's in town\nHe's the toughest around so everywhere that I go he goes\nHe's Charlie Mack and he's the first out the limo\n\n(So damn tough)\n\nI guess you're wondering why he's the first out the limo, yo, let me give you this bit of info\nSo you'll know the things that Charlie can do and you'll know every single reason why he's down with the crew\nThe limo picks us up about a half past six\nWith the radio blasting our latest hit\nIt's me Jeff Ready Rock, Omar and J.L.\nCharlie Mack is up front as we depart the hotel\nFirst we cause chaos throughout the city streets\nThen maybe stop at Burger King for a bite to eat\nAnd if somebody gets stupid while we're in the place\nCharlie cancels his order and bites off their face\nHe's not a troublemaker in fact, he's a trouble breaker\nAnd if somebody gets dumb, well it'll only take a second or two, after some fools snaps\nLaw and order is restored by my hero Charlie Mack\nWheel off into the limo, and head for the jam\nCharlie cracks all the knuckles, on both of his hands\nAnd when we pull up to the show, the routine is unrehearsed\nIt's just natural that we let Charlie hop out first\nHe clears the crowd without saying a word man\nThat's the loudest silence I've ever heard\nA lot of times guys test him, by trying to bug\nHe just, leaves ring imprints, all over their mugs\nHe's a terminator, a Hercules of sorts\nMan to hell with chess, he likes physical sports\nYou may not have known before but now you know\nThe reason why Charlie Mack is the first out the limo\n\n(So damn tough)\n\nWe'd like to apologise to all of our fans\nBut please don't touch us when we're at our jams\nCause Charlie don't like folks around us when we're doing a show\nAnd if he punches you, uh-oh, better get Mako\nStill you weak rap dudes tempers are hot\nJust because I've got something that you ain't got\nIf you want to get physical, rowdy or try to bomb me\nI won't get excited, I'll just say Yo Charlie\nYou should a been kind, you shouldn't have snapped\nCharlie only hit you once and now you're taking a nap\nAnd when he leaves you decapitated, crushed in the dust\nYou'll look up, and see your girl in the limo with us\nYou may think that's enough boy but I think not\nCharlie kick his face again I think you missed a spot\nI roll down the limo window and yell by the way eyes\nYou'll see your girl buck naked giving Charlie a massage\nI'm serious I'm not joking no doubt\nYou know how many doubters' bones have been broken\nYou may not have known before but now you know\nThe reason why Charlie Mack is the first out the limo\n\n\nCharlie Mack the first out the limo\nHe's Charlie Mack the first out the limo\n\nIn closing, we'd like to say this, to you bustas\nIf you're sceptical you'll probably get beat up, plus kid\nEmbarrassed and laughed at, by all of your friends\nAnd if you cross Charlie Mack it's the beginning of the end\nOf life as you know it, you might not die, sir\nBut if you're not dead, you'll wish you were\nBut if you still wanna bug out, homeboy let's go\nYou can bug with Charlie Mack 'cause he's the first out the limo\n\nHe's Charlie Mack and he's the first out the limo", "country": "West Philadelphia", "province": "Pennsylvania", "city": "United States"}, {"title": "Break Away", "artist": "Aranda", "lyric": "You got me wrapped around your finger\nWho I am, I don't know anymore\nGot me blinded by your circumstance\nI'm stuck in the middle\nSee, I know how the story goes\nIf you love me, gotta let it go\n'Cause I'm starting to see what I want to be\nAnd I'm not giving up on it\n\nAnd I, I gotta get away\nGotta make a change\nI don't wanna give you up\nBut this is more than I can take\nGotta set you free, wanted to believe\nBut I've finally had enough\nI gotta break away, yeah\nOh, gotta break away\nI gotta break away\n\nCan't you see this time is passing\nIt's gone before you know it\nAnd I don't think you really understand\nOh, but now I see it\nI think you know how the story goes\nIf you love me, baby let me go\n'Cause the cage that I find\nIs yours, not mine\nAnd I won't be your prisoner\n\nAnd I, I gotta get away\nGotta make a change\nI don't want to give you up\nBut this is more than I can take\nGotta set you free, wanted to believe\nBut I finally had enough\nI gotta break away, yeah\nOh, c'mon, gotta break away\nWhoa-oh\n\nAnd I don't know where\nThis road is taking me\nBut I'm moving on\nAnd I'm never looking back\n\nHere we go\nSaid I, I gotta get away\nGotta make a change\nI don't wanna give you up\nBut this is more than I can take\nGotta set you free, wanted to believe\nBut I finally had enough\n\nAnd I, I gotta get away\nGotta make a change\nI don't wanna give you up\nBut this is more than I can take\nGotta set you free, wanted to believe\nBut I finally had enough\nI gotta break away, yeah\nOh, gotta break away\nHey, c'mon, oh gotta break away\n\nWanted to believe\nWanted to believe\nWanted to believe", "country": "Oklahoma City", "province": "Oklahoma", "city": "United States"}, {"title": "I Love Your Smile", "artist": "Tiffany Evans", "lyric": "Sitting in my class\nJust drifting away\nStaring into the windows of the world\nI can't hear the teacher\nHis books don't call me at all\nI don't see the bad boys trying to catch some play\n\n'Cause I love your smile\nI love your smile\n\nThe clock at work says 3:00\nAnd I wanna be free\nFree to scream, free to bathe\nFree to paint my toes all day\n\nMy boss is lame, you know\nAnd so is the pay\nI'm gonna put that new black mini on my charge anyway\n\n'Cause I love your smile\nI love your smile\n\nTime came and showed me your direction\nNow I know I'll never ever go back\nTaught me that\nI can be a better girl with love you give\nYou rock my world\nYou dig\n\nI'm showing the life that I'm living\nThis is the life that I have\nAnd it's given to you\nYeah\nAnd it's true\nLa-de-da\nTwinkley dee\nDo you?\n\nBelieve in a girl like me\nTiffany is the one for you to be with\nBut when I'm caught\nAll alone\nI start fessing\nIt's from a state of depression\n\nAnd the thunder clouds of doubt move in\nI begin to wonder\n\"Do you still love me?\"\nBut after that\nMy whole world is beautiful\n\nTime came and showed me your direction\nNow I know I'll never ever go back\nTaught me that\nI can be a better girl\nWith the love you give\nYou rock my world\nYou dig?\n\n'Cause I love your smile\nI love your smile", "country": "New York City", "province": "New York", "city": "United States"}, {"title": "I Found Out", "artist": "Kaleidoscope", "lyric": "I found out, well out of doubt\nWhat it's all about\nAnd now I know, in my soul\nJust where to go\n\nAnd all I need is soothing set and sounds of making\nIn my mind, is where I go to be\n\nAh...\n\nI found love, when my everything\nIs just the same\nI got a song, it's not long\nAnd there's nothing wrong\n\nEverybody is finding time to twist about\nReality, it must be seen to keep you clean", "country": "", "province": "", "city": ""}, {"title": "Pull Up On A Kid", "artist": "Young Thug", "lyric": "I know all my whips are foreign, I know all your bitches borin'\nI know I gained me some weight when I was tourin'\nFresh and clean like a new born, I wet that bitch and then wet yours\nI ride that beat with no insurance, what you tell 'em Thugger?\n\nPull up on a kid, pull up on a kid\nPull up on a kid, pull up on a kid\nPull up on a kid, pull up on a kid\nPull up on a kid, baby pull up on a kid (Skrr, skrr)\nPull up on a kid (Pull up, pull up, pull up, pull up)\nPull up on a kid (Pull up, pull up, pull up, pull up)\nYou need to pull up a on kid, yeah, yeah, yeah, yeah, yeah\n\n(YSL, Thugger, Thugger, baby)\nOoh she bad, damn she bad, yeah she bad, yeah\nMichael Jackson, Freddy Jackson check my jacket, yeah\nBalmain jeans, extended tee, that my swag, yeah\nBad bitch, know I'm loaded, so they taxing, yeah\nWrite it off, hold it, make her come back like she owe me\nShe know it, I tapped on that ass and she turn around and show it\nOh lord, moved out of Miami now she think she's Zoeing\nThey know her they taught her they showed her\nFresh as a peppermint, threesome like sandwiches\nAlmost couldn't handle it, I don't establish it\nPopping these Xannies and Percs, I'm dranking that lean and I'm smoking that good\nTold that little bitch I want to see her topless just like a hood\n\nPull up on a kid, pull up on a kid\nPull up on a kid, pull up on a kid\nPull up on a kid, pull up on a kid\nPull up on a kid, baby pull up on a kid (Skrr, skrr)\nPull up on a kid (Pull up, pull up, pull up, pull up)\nPull up on a kid (Pull up, pull up, pull up, pull up)\nYou need to pull up a on kid, yeah, yeah, yeah, yeah, yeah\n\nOG, yeah, yeah, yeah\nOh, green, green\nHa! Slack, yeah, yeah\nClean, clean, yeah\nI'm back, where I motherfucking left that\nMinor setback for a major fucking comeback\nWrap the fucking show, rock and roll this a death trap\nPlaying with my slimes, you won't make it out the exit\nMr. Brazy hoho, Mrs. Brazy hoho\nAnybody get it, enie-meenie-mo'\nI'm the same nigga used to pull up on the mail truck\nIf you ask me, it feel good\n\nPull up on a kid, pull up on a kid\nPull up on a kid, pull up on a kid\nPull up on a kid, pull up on a kid\nPull up on a kid, baby pull up on a kid (Skrr, skrr)\nPull up on a kid (Pull up, pull up, pull up, pull up)\nPull up on a kid (Pull up, pull up, pull up, pull up)\nYou need to pull up a on kid, yeah, yeah, yeah, yeah, yeah", "country": "Atlanta", "province": "Georgia", "city": "United States"}, {"title": "If You Gotta Break Another Heart", "artist": "Albert Hammond", "lyric": "If you gotta break another heart\nThen break it, come on and break it\nIf you gotta take that kind of chance\nThen take it, go on and take it\n\nAnything I say or do will make no difference\nIn the end you'll go ahead and do what you really wanna do\n\nIf you gotta break another heart, then break it\nIf you gotta take that kind of chance\nThen take it, you are free to take it\nBut don't come runnin' back to me\n\nIf you're gonna make another change\nThen make it, go on and make it\nIf you're gonna do it, do it now\nDon't leave it 'cause I can't take it\n\nEverybody knows that you were born a drifter\nYou were born a drifter, baby, you'll never, never settle down\n\nIf you gotta break another heart, then break it\nIf you gotta take that kind of chance\nThen take it, you are free to take it\nBut don't come runnin' back to me\n\nIf you gotta play another tune, then play it\nIf you gotta say what's on your mind\nThen say it, go ahead and say it\nBut don't come runnin' back to me\n\nDa-da-da-da-da-da-da-da-da, then break it\nDa-da-da-da-da-da another chance\nThen take it, you are free to take it\nBut don't come runnin' back to me\n\nIf you gotta play another tune...", "country": "City of London", "province": "London", "city": "England"}, {"title": "Loved", "artist": "Cranes", "lyric": "Try to hold on\nThough it seems you can't go on\nYou know that you can be strong\nFind a way to carry on\n\nAnd God bless your soul\nIn the heavens up above\nIf you can't find a way\nYou must know that you are loved\n\nTry to be strong\nFind a way to carry on\nI know you are brave\nAnd I hope you find your way\n\nIs there a reason why\nThe sky gets black at night and\nOur hearts feel like stone\nAnd you're left to face this alone?\n\nTry to be strong\nFind a way to carry on\nI know you are brave\nAnd I hope you find your way\nI know you are brave\nAnd I hope you find your way", "country": "Portsmouth", "province": "Hampshire", "city": "England"}, {"title": "Caminando", "artist": "Santana", "lyric": "<i>Unfortunately, we are not licensed to display the full lyrics for this song at the moment. Hopefully we will be able to in the future. Until then... how about a <a href=\"/wiki/Special:Random\" title=\"Special:Random\">random page</a>?</i>", "country": "San Francisco", "province": "California", "city": "United States"}, {"title": "Movement I Adagio", "artist": "The Suicide Of Miss Melancholy", "lyric": "Rummage sales of ancient advertisements\nCloud the churches all around the empty city\nLeaving sermons to the lowlifes in the press box...\nA nation stands defenseless\n\nGraduation Day and all the hounds are gathered\nScouting out the future talent for a desk job\nLittle babies taught that spending is a virtue...\nIntegrity is plastic.\n\nHow long? How long until you open up your eyes?\nHow long? How long?\n\nNew December, and all the children are praying,\nTo a Coca-Cola, Santa Claus Messiah\nAll the parents are burning up their checkbooks...\nCelebrate the giving\n\nHow long? How long until you open up your eyes?\nHow long? How long?\n\nIs it too much to ask for some divulgence\nOf the melancholy madness all around us?\nTurn a blind eye to an incarcerated conscience...\nAmerica, the godless\n\nHow long? How long until you open up your eyes?\nHow long? How long?", "country": "", "province": "", "city": ""}, {"title": "Killer In You", "artist": "Limp Bizkit", "lyric": "There's a motherfucking killer on the loose\nAnd he'll destroy every single one of you\nYou better watch it 'cause he's looking for your ass now\nBetter lock all your doors and shut the house down\nHe's making a list and he's checking it twice\nHe was born pissed and he's ready to slice\nHis reality ain't like yours or mine\nHe can shed blood I hope it ain't mine\nHe don't give a fuck if your crying for help\nHe was born blind in the chambers of hell\nSatan gave his homeboy a license to kill\nAnd if he comes knocking I'm going to show him the deal\n\nWhat the fuck you gonna do about that\nWhat the fuck you gonna do about that\nWhen the killer shows up with a gat\nYou gonna have to grab yourself a baseball bat\nTo remind this motherfucker where the home runs at\n\nWhat the fuck you gonna do about that\nWhat the fuck you gonna do about that\nYour gonna have to face the moment of truth\nYou know what to do\nYou gonna have to find the killer in you\n\nHe's got a trunk full of hatches and shit\nBombs, gasoline, matches and shit\nAnything to make a human die quick\nCreeping in the night like some superfly shit\nSo scandalous and everything about him is wrong\nChainsaw starting up at the crack of dawn\nLeatherface is a pussy he don't compare\nHe'll have you shitting in your motherfucking underwear\nAll your homies coming hard better get a grip\nHe'll kill your wife and your baby sleeping in the crib\nWe got to stop and shut this motherfucker down\nShow his ass who runs this motherfucking town\nShow his ass who runs this motherfucking town\n\nWhat the fuck you gonna do about that\nWhat the fuck you gonna do about that\nWhen the killer shows up with a gat\nYou gonna have to grab yourself a baseball bat\nTo remind this motherfucker where the home runs at\n\nWhat the fuck you gonna do about that\nWhat the fuck you gonna do about that\nYour gonna have to face the moment of truth\nYou know what to do\nYou gonna have to go and find the killer in you\n\nLay that motherfucker on the curb\nLet's find the killer in you\nShow that motherfucker the deal\nAnd now it's real\nAnd now it's real\n\nKill that motherfucker\nKill that motherfucker\nKill that motherfucker\nKill that motherfucker\nKill that motherfucker\nKill that motherfucker\nKill that motherfucker\nKill that motherfucker\n\nWhat the fuck you gonna do about that\nWhat the fuck you gonna do about that\nWhen the killer shows up with a gat\nYou gonna have to grab yourself a baseball bat\nTo remind this motherfucker where the home runs at\n\nWhat the fuck you gonna do about that\nWhat the fuck you gonna do about that\nYour gonna have to face the moment of truth\nYou know what to do\nYou gonna have to go and find the killer in you", "country": "Jacksonville", "province": "Florida", "city": "United States"}]